import tistory


token = 'YOUR_TISTORY_TOKEN'


blog = '''
<img src="https://www.barcelonaconnect.com/wp-content/uploads/2019/09/La-Rambla-Barcelona-1.jpg" alt="La Rambla"><h1>이라 람블라: 바르셀로나의 유명한 거리를 살펴보다</h1>
<p>라 람블라는 바르셀로나의 가장 유명한 거리 중 하나고 유럽에서 가장 방문객이 많은 곳 중 하나어. 이 넓은 대로는 삶, 문화, 역사로 가득 차 있다. 바르셀로나의 풍경과 소리를 즐기기 위해 전 세계 사람들이 모이는 곳이어.</p>
<h2>이라 람블라의 역사</h2>
<p>라 람블라의 기원은 벽으로 둘러싸인 좁은 길이었던 14 세기로 거슬러 올라간다. 시간이 지나면서, 그 지역은 커졌고 벽은 건물과 집으로 대체됐다. 이 거리는 18 세기에 확장됐고, 1837년에 현재의 이름이 붙여졌다.</p>
<p>그 이후로, 라 람블라는 현지인들과 관광객들 모두에게 인기 있는 목적지가 됐다. 이곳은 다양한 상점, 식당, 그리고 명소들의 본거지다. 그 거리는 나무들로 늘어서 있고, 거리 공연자들, 노점상들, 그리고 다채로운 캐릭터들로 가득 차 있어.</p>
<h2>이라 람블라에서 볼 것</h2>
<p>라 람블라는 탐험하기 좋은 곳이다. 할 것도 많고 볼 것도 많다. 다음은 몇 가지 주요 사항입니다:.</p>
<p>-라 보케리아: 이 세계적으로 유명한 시장은 라 람블라의 시작에 위치해 있다. 그것은 신선한 과일, 야채, 그리고 해산물로 가득 차 있어. 지역 특산물을 꼭 먹어 보세요.</p>
<p>-모뉴먼트 어 콜롬: 이 기념비는 라 람블라 끝에 위치해 있으며 탐험가 크리스토퍼 콜럼버스를 기념하고 있다.</p>
<p>-카탈루냐 광장: 이 광장은 라 람블라와 파세그 드 그라시아의 교차로에 위치해 있다. 그곳은 휴식을 취하고 사람들이 보기에 좋은 장소다.</p>
<p>-바르셀로나 역사 박물관: 이 박물관은 비르레이나 궁전에 위치해 있으며 방문객들에게 바르셀로나의 역사를 볼 수 있게해 줘.</p>
<p>-카날레트 글꼴: 이 분수는 라 람블라의 끝 근처에 위치해 있다. 분수대에서 물을 마시면 언제나 바르셀로나로 돌아온다고 한다.</p>
<h2>이라 람블라에서 쇼핑하기</h2>
<p>라 람블라는 다양한 상점과 부티크의 본거지다. 여러분은 옷과 보석에서부터 기념품과 예술품에 이르기까지 모든 것을 찾을 수 있어. 다음은 가장 인기 있는 몇 가지입니다:.</p>
<p>-엘 코르테 잉글레스: 이 백화점은 라 람블라가 시작하는 곳에 위치해 있다. 그곳은 바르셀로나에서 가장 인기 있는 쇼핑 장소 중 하나어.</p>
<p>-Els Encants Vells: 이 벼룩 시장은 La Rambla 끝에 위치해 있고 14 세기부터 운영되고 있어.</p>
<p>-La Manual Alpargatera: 이 가게는 모뉴멘타 콜롬 근처에 위치하고 있으며 수제화 전문점이어.</p>
<p>-라 보티가 데 바르셀로나: 이 가게는 퐁 드 카날레테스 근처에 위치해 있으며 기념품과 다른 물건들을 판매한다.</p>
<h2>이라 람블라에서 먹기</h2>
<p>라 람블라는 다양한 레스토랑과 카페의 본거지다. 여러분은 전통적인 스페인 요리부터 국제적인 요리까지 모든 것을 찾을 수 있어. 다음은 가장 인기 있는 몇 가지입니다:.</p>
<p>-Bar del Pla: 이 카페는 라 람블라의 시작 근처에 위치하고 있으며 아침 식사나 가벼운 점심 식사를 하기에 좋은 장소어.</p>
<p>-Quimet &amp;Quimet: 이 식당은 기념비 콜 롬 근처에 위치하고 있으며 타파스로 유명하다.</p>
<p>-레스토랑 라 폰다: 이 식당은 라 람블라 끝 근처에 위치하고 있으며 해산물을 전문으로 해.</p>
<p>-라 까사 델 카페: 이 카페는 Font de Canalettes 근처에 위치하고 있으며 커피와 페이스트리를 위한 훌륭한 장소어.</p>
<h2>이라 람블라의 밤 문화</h2>
<p>라 람블라는 밤 생활을 즐기기에 좋은 장소어. 선택할 수 있는 많은 술집과 클럽이 있고, 그들은 밤늦게까지 문을 연다. 다음은 가장 인기 있는 몇 가지입니다:.</p>
<p>-보니타 라 마스: 이 바는 라 람블라의 시작 근처에 위치하고 있으며 캐주얼한 음료를 마시기에 좋은 장소어.</p>
<p>-라 테라자: 이 루프탑 바는 Memonate a Colom 근처에 위치하고 있으며 도시의 멋진 전망을 제공해.</p>
<p>-엘 리세우: 이 극장은 라 람블라 끝 근처에 위치해 있으며 다양한 공연을 개최한다.</p>
<p>-라 보이트: 이 나이트클럽은 퐁 드 카날레테스 근처에 위치해 있으며 심야 댄스로 유명한 장소다.</p>
<h2>이라 람블라 체험</h2>
<p>라 람블라는 활기차고 신나는 방문지어. 모두를 위한 것이 있고, 거리의 풍경과 소리에 길을 잃기 쉽다. 쇼핑, 식사, 야간 생활을 찾던 라 람블라는 모든 것을 갖추고 있어.</p>
'''


print(len(blog))
tistory.post_blog("111", blog, 'tag', '0', "nothinkblarblar", token)

blog_final = ""

if len(blog) > 1400:
    print("*****length is too long : ", len(blog))
    blog_slice = blog[:1400] + "</p>"
    blog_final = blog_slice
else:
    print("*****length is : ", len(blog))
    blog_final = blog

print(len(blog_final))
print(blog_final)

expose_y = '3'  # 공개 게시
expose_n = '0'  # 비공개 게시

tistory.post_blog("222", blog_final, 'tag', expose_n, "nothinkblarblar", token)
